<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current release of ColorChecker Camera Calibration</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.ColorCheckerCameraCalibration</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>XRiteColorCheckerCameraCalibration</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.xrite.com/service-support/product-support/calibration-solutions/colorchecker-digital-sg</string>
                <key>re_pattern</key>
                <string>(/service-support/downloads/c/colorchecker_camera_calibration_v2.1.[0-9])</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.xrite.com%match%</string>
                <key>re_pattern</key>
                <string>(https://my.xrite.com/downloader.aspx\?FileID=[0-9][0-9][0-9][0-9]\&Type=M)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>curl_opts</key>
                <string>location</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
