<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download lastest Dell UltraSharp Calibration Solution and import into Munki</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.DellUltraSharpCalibrationSolution</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DellUltraSharpCalibrationSolution</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/XRite</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Dell UltraSharp Calibration Solution</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This solution lets you get the best, most accurate, color possible with your Dell UltraSharp display</string>
            <key>display_name</key>
            <string>Dell UltraSharp Calibration Solution</string>
            <key>minimum_os_version</key>
            <string>10.6.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.DellCalibrationSolution</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Dell UltraSharp Calibration Solution.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
