<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download lastest Dell UltraSharp Calibration Solution and import into FileWave</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.pkg.DellUltraSharpCalibrationSolution</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dell UltraSharp Calibration Solution</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.filewave.pkg.DellUltraSharpCalibrationSolution</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jazzace.download.DellCalibrationSolution</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/Dell Calibration Solution/Dell*.pkg</string>
 			</dict>
 			<key>Processor</key>
 			<string>FileFinder</string>
 		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    </array>
</dict>
</plist>
