<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import X-Rite i1Profiler into FileWave</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.i1Profiler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>i1Profiler</string>
	<key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.filewave.i1Profiler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.i1Profiler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
                <key>skip_payload</key>
                <false/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/temp</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/XRD_Manager_Component.pkg/Payload</string>
            </dict>
        </dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkgdirs</key>
			<dict>
				<key>Library</key>
				<string>0775</string>
				<key>Library/Application Support</key>
				<string>0775</string>
				<key>Library/Application Support/HASP</key>
				<string>0775</string>
				<key>Applications</key>
				<string>0775</string>
				<key>Applications/i1Profiler</key>
				<string>0775</string>
			</dict>
			<key>pkgroot</key>
			<string>%RECIPE_CACHE_DIR%/root</string>
		</dict>
		<key>Processor</key>
		<string>PkgRootCreator</string>
	</dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root/Library/Application Support/HASP</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/haspComponent.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root/Library/LaunchDaemons</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/comxritehaspdrivers.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/temp2</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/i1profilertray.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root/tmp</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/installhasp.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root/Library/Application Support</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/userfiles.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>FALSE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root/Applications/i1Profiler</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flatpkg/i1profiler.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/source/i1ProfilerTray.app</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/root/Applications/i1Profiler/i1ProfilerTray.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/temp/*</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/root/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/root/Applications/i1Profiler/i1Profiler.app/Contents/Info.plist</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
