<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import X-Rite i1Profiler into FileWave</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.i1ProfilerInstaller</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>i1Profiler</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.filewave.i1ProfilerInstaller</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.i1Profiler</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<string>true</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
    </array>
</dict>
</plist>
