<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of PANTONE Color Manager and imports into FileWave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.PantoneColorManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PANTONE Color Manager</string>
		<key>fw_app_bundle_id</key>
        	<string>com.github.nielshojen.filewave.pkg.PantoneColorManager</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.PantoneColorManager</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>archive_path</key>
 				<string>%pathname%</string>
 				<key>purge_destination</key>
 				<true/>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/pkg</string>
 			</dict>
 			<key>Processor</key>
 			<string>Unarchiver</string>
 		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>/</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/root</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
