<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Sonos and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.PantoneColorManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PantoneColorManager</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.PantoneColorManager</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%app_name%</string>
				<key>purge_destination</key>
				<string>true</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
