<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of DisplayLink Manager and imports into Munki</string>
        <key>Identifier</key>
        <string>com.github.nielshojen.munki.DisplayLinkManager</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>DisplayLink Manager</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>DisplayLink Manager is a new way to enable your DisplayLink dock, adapter or monitor on macOS platforms. It's an application that combines our latest driver with features that streamline the setup of mutliple displays up to 4K.</string>
                <key>developer</key>
                <string>DisplayLink</string>
                <key>display_name</key>
                <string>DisplayLink Manager</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true></true>
                <key>unattended_uninstall</key>
                <true></true>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.smithjw.nielshojen.DisplayLink_Manager</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>purge_destination</key>
                    <true/>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/DisplayLinkManager.pkg</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>purge_destination</key>
                    <true/>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/DisplayLinkManagerApp.pkg/Payload</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/DisplayLink Manager.app/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/DisplayLink Manager.app</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>app_version</string>
                        <key>LSMinimumSystemVersion</key>
                        <string>min_os_version</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>PlistReader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.nielshojen.SharedProcessors/VersionExtractor</string>
                <key>Arguments</key>
                <dict>
                    <key>input_file</key>
                    <string>%version%</string>
                    <key>split_on_in</key>
                    <string></string>
                    <key>split_on_out</key>
                    <string> </string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>blocking_applications</key>
                        <array>
                            <string>%DISPLAY_NAME%</string>
                        </array>
                        <key>minimum_os_version</key>
                        <string>%min_os_version%</string>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>com.displaylink.DisplayLinkUserAgent</string>
                                <key>CFBundleName</key>
                                <string>DisplayLinkUserAgent</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%app_version%</string>
                                <key>path</key>
                                <string>/Applications/DisplayLink Manager.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>CFBundleShortVersionString</string>
                            </dict>
                        </array>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>RECIPE_CACHE_DIR%/downloads/DisplayLinkManager.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
