<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Plenom Busylight for Microsoft Teams, builds a package and imports it to Munki.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.autopkg.munki.PlenomBusylight</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PlenomBusylight</string>
        <key>DISPLAY_NAME</key>
        <string>Plenom Busylight</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/PlenomBusylight</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Communication</string>
            <key>description</key>
            <string>Presence, Ringer and Notification for Microsoft Teams</string>
            <key>developer</key>
            <string>Plenom</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.3</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.Busylight4MSTeams</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
