<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Glyphs app, creates pkg and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.Glyphs2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Glyphs2</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.pkg.Glyphs2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.timsutton.download.Glyphs2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%download_path%</string>
				<key>archive_format</key>
				<string>zip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
