<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of SuperPNG</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.superpng</string>
    <key>Input</key>
    <dict>
		<key>DOWNLOAD_URL</key>
		<string>http://www.fnordware.com/superpng/</string>
		<key>RE_PATTERN</key>
		<string>(SuperPNG_v(?P&lt;version&gt;[0-9].[0-9])_mac.dmg)</string>
        <key>NAME</key>
        <string>SuperPNG</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>%RE_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%%match%</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
