<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Crypt 2 from Github and imports into Filewave.
    </string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.Crypt2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Crypt2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.Crypt2</string>
    <key>Process</key>
    <array>
    </array>
</dict>
</plist>
