<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of FUSE for macOS and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.osxfuse</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FUSE for macOS</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.pkg.osxfuse</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.osxfuse</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>com.github.nielshojen.SharedProcessors/LZMADecompress</string>
    		<key>Arguments</key>
    		<dict>
    			<key>lzma_file</key>
    			<string>%RECIPE_CACHE_DIR%/payload/</string>
    			<key>decompressor</key>
    			<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Scripts/finalize</string>
    		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>source_path</key>
				<string>%download_path%/Extras/FUSE for macOS *.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
