<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Imports mtr into munki</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.mtr</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>mtr</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Utilities</string>
        <key>description</key>
        <string>Combined traceroute and ping tool.</string>
        <key>developer</key>
        <string>Matt Kimball</string>
        <key>display_name</key>
        <string>mtr</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.mtr</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
            <key>pkginfo</key>
            <dict>
                <key>minimum_os_version</key>
                <string>%OSX_VER%.0</string>
            </dict>
        </dict>
      </dict>
    </array>
  </dict>
</plist>