<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Wacom Intuos driver installer and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.WacomInkspace</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WacomInkspace</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.WacomInkspace</string>
	<key>Process</key>
	<array>
		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>app_path</key>
 				<string>%RECIPE_CACHE_DIR%/%NAME%/Wacom Inkspace App.app</string>
 			</dict>
 			<key>Processor</key>
 			<string>AppPkgCreator</string>
 		</dict>
	</array>
</dict>
</plist>
