<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TrapcodeSuite.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.download.TrapcodeSuite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Trapcode Suite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://downloads.redgiant.com/redgiant/products/singlesuites/trapcode/TCSuite_Mac_Full.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
