<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Downloads the current release of Power Monitor.app from the power-monitoring-tool-for-macos release page on Github: https://github.com/SAP/power-monitoring-tool-for-macos/releases and imports it into Munki</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.PowerMonitor</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>PowerMonitor</string>
		<key>DISPLAY_NAME</key>
		<string>Power Monitor</string>
        <key>VENDOR</key>
        <string>SAP</string>
        <key>SOFTWARETITLE1</key>
        <string>Power</string>
        <key>SOFTWARETITLE2</key>
        <string>Monitor</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Power Monitor is a powerful tool that provides real-time insights into your device's energy consumption and carbon footprint, linked to your location.</string>
			<key>developer</key>
			<string>Fumihiko Takayama</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.PowerMonitor</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
