<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Puppet and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.nielshojen.munki.puppet</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Puppet</string>
            <key>MUNKI_CATEGORY</key>
            <string>System</string>
            <key>NAME</key>
            <string>Puppet_%ARCH%</string>
            <key>OS_VERSION</key>
            <string>12</string>
            <key>ARCH</key>
            <string>x86_64</string>
            <key>URL</key>
            <string>https://downloads.puppetlabs.com/mac/puppet7</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Puppet is a configuration management solution that allows you to define the state of your IT infrastructure, and then automatically enforces the desired state.</string>
                <key>minimum_os_version</key>
                <string>%OS_VERSION%.0</string>
                <key>maximum_os_version</key>
                <string>%OS_VERSION%.99</string>
                <key>developer</key>
                <string>Puppet</string>
                <key>display_name</key>
                <string>Puppet</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.nielshojen.download.puppet</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%/*.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_%version%_%ARCH%.pkg</string>
                    <key>overwrite</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_%version%_%ARCH%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
