<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PolyLens</string>
        <key>PRODUCT_PID</key>
        <string>lens-desktop-mac</string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of Poly Lens.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.download.PolyLens</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>com.github.nielshojen.SharedProcessors/PolyURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_pid</key>
                <string>%PRODUCT_PID%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
