<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Poly Lens, unpacks it and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.PolyLens</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Audio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
    	<key>NAME</key>
    	<string>PolyLens</string>
    	<key>DISPLAY_NAME</key>
    	<string>Poly Lens</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Poly, Inc.</string>
            <key>description</key>
            <string>Poly Lens Desktop is a single app for customizing your compatible personal devices to how you work. Staying up to date with the latest software is just a click away. You'll also have access to product guides, room setup and support, right at your fingertips. And with built-in wellness and nature sounds, you'll have better focus and peace of mind, so you'll look and sound great. Not to mention smarter.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.PolyLens</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
