<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Control Center.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.logitechcontrolcenter</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogitechControlCenter</string>
            <key>URL</key>
            <string>https://support.logi.com/api/v2/help_center/en-us/articles.json\?label_names=webcontent=productdownload,websoftware=ebdfd5a3-8e0b-11e9-a62b-d1e7600b0d0b,webos=mac-macos-x-11.0&amp;per_page=1</string>
            <key>SEARCH_PATTERN</key>
            <string>(?P&lt;url&gt;https:\/\/download01\.logi\.com\/web\/ftp\/pub\/techsupport\/mouse\/mac\/lcc(?P&lt;version&gt;.*?)\.zip)</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.2 Safari/605.1.15</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>%url%</string>
        	   <key>filename</key>
        	   <string>%NAME%-%version%.zip</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app</string>
				<key>requirement</key>
				<string>identifier "com.Logitech.ControlCenter.Update" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA</string> 
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>