<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Control Center.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.pkg.logitechcontrolcenter</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogitechControlCenter</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
		<key>ParentRecipe</key>
		<string>com.github.nielshojen.download.logitechcontrolcenter</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleIdentifier</key>
                        <string>PKG_ID</string>
                        <key>LSMinimumSystemVersion</key>
                        <string>MIN_OS</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app/Contents/Resources/Logitech Control Center.mpkg</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
                </dict>
                <key>Processor</key>
                <string>FileMover</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/application_payload</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/logitechControlCenter.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%pkgroot%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/logitechUnifyingSoftware.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%pkgroot%</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/logitechUpdater.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%pkgroot%</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%pkgroot%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>     
</plist>