<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Logitech Options (Bluetooth and USB) and imports it into FileWave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.pkg.filewave.logitechoptions</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Logitech Options</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.pkg.filewave.logitechoptions</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.logitechoptions</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/Contents/Resources/LogiMgr.mpkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Logitech Options.mpkg</string>
            </dict>
            <key>Processor</key>
            <string>FileMover</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/LogiMgr/</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>fw_app_bundle_id</key>
                <string>%fw_app_bundle_id%</string>
                <key>fw_app_version</key>
                <string>%version%</string>
                <key>fw_fileset_name</key>
                <string>%NAME% - %version%</string>
                <key>fw_import_source</key>
                <string>%RECIPE_CACHE_DIR%/Logitech Options.mpkg</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
        </dict>
    </array>
</dict>
</plist>
