<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Logitech Control Center and imports it into FileWave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.pkg.filewave.logitechcontrolcenter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Logitech Control Center</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.pkg.filewave.logitechcontrolcenter</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.pkg.logitechcontrolcenter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>fw_app_bundle_id</key>
                <string>%fw_app_bundle_id%</string>
                <key>fw_app_version</key>
                <string>%version%</string>
                <key>fw_fileset_name</key>
                <string>%NAME% - %version%</string>
                <key>fw_import_source</key>
                <string>%pkg_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
        </dict>
        <dict>
            <key>Arguments</key> 
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/application_payload</string>
                    <string>%pkg_path%</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
