<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Control Center.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.pkg.logitechcontrolcenter</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogitechControlCenter</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
		<key>ParentRecipe</key>
		<string>com.github.nielshojen.download.logitechcontrolcenter</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app/Contents/Resources/Logitech Control Center.mpkg</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
                </dict>
                <key>Processor</key>
                <string>FileMover</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        </array>
    </dict>
</plist>