<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads customizes the installer and create a new pkg.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.SplashtopStreamer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SplashtopStreamer</string>
		<key>DEPLOY_CODE</key>
		<string>-REPLACE-ME-</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.SplashtopStreamer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Splashtop_Streamer-installer.pkg/Scripts/PreInstall.plist</string>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Splashtop_Streamer-installer.pkg/Scripts/PreInstall.plist</string>
				<key>plist_data</key>
				<dict>
					<key>Common</key>
					<dict>
						<key>EulaAccepted</key>
						<true/>
						<key>HidePreferenceDomainSelection</key>
						<true/>
					</dict>
					<key>STP</key>
					<dict>
						<key>DeployCode</key>
						<string>%DEPLOY_CODE%</string>
						<key>DeployTeamNameCache</key>
						<string></string>
						<key>DeployTeamOwnerCache</key>
						<string></string>
						<key>LastDeployCode</key>
						<string></string>
						<key>ShowDeployLoginWarning</key>
						<false/>
						<key>ShowDeployMode</key>
						<true/>
						<key>SplashtopAccount</key>
						<string></string>
						<key>TeamCode</key>
						<string></string>
						<key>TeamCodeInUse</key>
						<string></string>
					</dict>
					<key>UniversalSetting</key>
					<true/>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistEditor</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
       		    <key>path_list</key>
        	    <array>
        	        <string>%RECIPE_CACHE_DIR%/unpack</string>
        	    </array>
        	</dict>
		</dict>
	</array>
</dict>
</plist>