<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads DYMO Label installer and imports into filewave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.DYMOLabel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DYMO Label</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.DYMOLabel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.dymolabel</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/*.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%build%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %build%</string>
				<key>fw_import_source</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    </array>
</dict>
</plist>
