<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of ChatGPT Atlas and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.ChatGPTAtlas</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.ChatGPTAtlas</string>
	<key>Input</key>
	<dict>
        <key>DISPLAY_NAME</key>
        <string>ChatGPT Atlas</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ChatGPTAtlas</string>
        <key>NAME</key>
        <string>ChatGPTAtlas</string>
        <key>VENDOR</key>
        <string>OpenAI</string>
        <key>SOFTWARETITLE1</key>
        <string>ChatGPT</string>
        <key>SOFTWARETITLE2</key>
        <string>Atlas</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Browsers</string>
            <key>description</key>
            <string>Bring ChatGPT with you across the web for instant answers, smarter suggestions, and help with tasks—all with privacy settings you can control.</string>
            <key>developer</key>
            <string>%VENDOR%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
