<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Screaming Frog Log Analyzer disk image.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.download.ScreamingFrogLogFileAnalyzer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Screaming Frog Log File Analyzer</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https://download.screamingfrog.co.uk/products/log-file-analyser/ScreamingFrogLogFileAnalyser-(?P&lt;version&gt;.*?).dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://www.screamingfrog.co.uk/wp-content/themes/screamingfrog/inc/download-modal-lfa.php</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Screaming Frog Log File Analyser.app</string>
				<key>requirement</key>
				<string>identifier "uk.co.screamingfrog.seo.spider" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = CAHEVC3HZC</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
