<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Oracle SQL Developer.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.SQLDeveloper</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharm</string>
        <key>SEARCH_URL</key>
        <string>https://www.oracle.com/tools/downloads/sqldev-downloads.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(download.oracle.com\/otn\/java\/sqldeveloper\/sqldeveloper-+[0-9].+[0-9].+[0-9].+[0-9].+[0-9]-macosx.app.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
