<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads VirtualBox installer and imports into filewave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.VirtualBox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VirtualBox</string>
	<key>fw_app_bundle_id</key>
	<string>com.github.nielshojen.filewave.VirtualBox</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.VirtualBox</string>
    <key>Process</key>
    	<array>
		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>pkgdirs</key>
 				<dict/>
 				<key>pkgroot</key>
 				<string>%RECIPE_CACHE_DIR%/installer</string>
 			</dict>
 			<key>Processor</key>
 			<string>PkgRootCreator</string>
 		</dict>
		<dict>
             		<key>Processor</key>
             		<string>Copier</string>
             		<key>Arguments</key>
             		<dict>
                 		<key>source_path</key>
                 		<string>%pathname%/*.pkg</string>
	               		<key>destination_path</key>
                 		<string>%RECIPE_CACHE_DIR%/installer/VirtualBox.pkg</string>
                		<key>overwrite</key>
                		<true/>
            		</dict>
        	</dict>
		<dict>
             		<key>Processor</key>
             		<string>Copier</string>
             		<key>Arguments</key>
             		<dict>
                 		<key>source_path</key>
                 		<string>%pathname%/*.tool</string>
	               		<key>destination_path</key>
                 		<string>%RECIPE_CACHE_DIR%/installer/uninstall.sh</string>
                		<key>overwrite</key>
                		<true/>
            		</dict>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/installer/VirtualBox.pkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    	</array>
</dict>
</plist>
