<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Repaper.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.Repaper</string>
    <key>Input</key>
    <dict>
        <key>SEARCH_PATTERN</key>
		<string>(<Version>+[0-9].+[0-9].+[0-9]</Version>)</string>
		<key>VERSION_URL</key>
		<string>http://s3.amazonaws.com/imagink/Repository/OS_X/Updates.xml</string>
        <key>NAME</key>
        <string>Kelvin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%VERSION_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/VersionExtractor</string>
			<key>Arguments</key>
			<dict>
				<key>input_file</key>
				<string>%match%</string>
				<key>split_on_in</key>
				<string>Version</string>
				<key>split_on_out</key>
				<string>Version</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://s3.amazonaws.com/imagink/Repository/OS_X/com.iskn.imagink/11.1.10%match%RepaperStudio.app.7z</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
