<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Repaper.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.Repaper</string>
    <key>Input</key>
    <dict>
        <key>SEARCH_PATTERN</key>
		<string>(<Version>+[0-9].+[0-9].+[0-9]</Version>)</string>
		<key>VERSION_URL</key>
		<string>http://s3.amazonaws.com/imagink/Repository/OS_X/Updates.xml</string>
        <key>NAME</key>
        <string>Repaper</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%VERSION_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%</string>
			    <key>plist_version_key</key>
			    <string>Version</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
