<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Karabiner Elements and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.KarabinerElements</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Karabiner</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>MacBook keyboard remapper.</string>
			<key>developer</key>
			<string>Fumihiko Takayama</string>
			<key>display_name</key>
			<string>Karabiner</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.KarabinerElements</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Installer.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Karabiner-Elements.app</string>
					<string>/Applications/Karabiner-Eventviewer.app</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-Elements/bin/karabiner_cli</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-Elements/bin/karabiner_console_user_server</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-Elements/bin/karabiner_grabber</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-Elements/bin/karabiner_observer</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-Elements/bin/karabiner_session_monitor</string>
					<string>/Library/Application Support/org.pqrs/Karabiner-VirtualHIDDevice/Extensions/org.pqrs.driver.Karabiner.VirtualHIDDevice.v061000.kext</string>
					<string>/Library/LaunchAgents/org.pqrs.karabiner.karabiner_console_user_server.plist</string>
					<string>/Library/Launchagents/org.pqrs.karabiner.karabiner_session_monitor.plist</string>
					<string>/Library/LaunchDaemons/org.pqrs.karabiner.karabiner_grabber.plist</string>
					<string>/Library/LaunchDaemons/org.pqrs.karabiner.karabiner_observer.plist</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%/Karabiner-Elements.sparkle_guided.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
