<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Karabiner Elements and imports into FileWave directly.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.KarabinerElements</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Karabiner</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.pkg.KarabinerElements</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.KarabinerElements</string>
	<key>Process</key>
	<array>

	</array>
</dict>
