<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Docker Toolbox installer and imports into filewave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.DockerToolbox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Docker Toolbox</string>
	<key>fw_app_bundle_id</key>
	<string>com.github.nielshojen.filewave.DockerToolbox</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.download.DockerToolbox</string>
    <key>Process</key>
    	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>skip_payload</key>
				<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/flatpkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    	</array>
</dict>
</plist>
