<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kiwi Fruitwares Media Converter.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.download.MediaConverter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jEdit</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
    <dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://sourceforge.net/projects/media-converter/files/latest/download?source=files</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
