<?xml version="1.0" encoding="UTF-8"?>
	<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
	<plist version="1.0">
	<dict>
	    <key>Description</key>
	    <string>Downloads latest Fuze.app</string>
	    <key>Identifier</key>
	    <string>com.github.nielshojen.download.Fuze</string>
	    <key>Input</key>
	    <dict>
	        <key>NAME</key>
	        <string>Fuze</string>
	    </dict>
	    <key>MinimumVersion</key>
	    <string>1.0.0</string>
	    <key>Process</key>
	    <array>
	        <dict>
	            <key>Processor</key>
	            <string>URLDownloader</string>
	            <key>Arguments</key>
	            <dict>
	                <key>url</key>
	                <string>https://api.fuzemeeting.com/v1/launch/mac_download</string>
	                <key>filename</key>
	                <string>Fuze.zip</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>EndOfCheckPhase</string>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>PkgRootCreator</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pkgroot</key>
	                <string>%RECIPE_CACHE_DIR%/payload</string>
	                <key>pkgdirs</key>
	                <dict>
	                    <key>Applications</key>
	                    <string>0775</string>
	                </dict>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>Unarchiver</string>
	            <key>Arguments</key>
	            <dict>
	                <key>purge_destination</key>
	                <true/>
	                <key>destination_path</key>
	                <string>%pkgroot%/Applications</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>Unarchiver</string>
	            <key>Arguments</key>
	            <dict>
	                <key>purge_destination</key>
	                <true/>
	                <key>destination_path</key>
	                <string>%pkgroot%/Applications</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>FileFinder</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pattern</key>
	                <string>%pkgroot%/Applications/Fuze*.app</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>FileMover</string>
	            <key>Arguments</key>
	            <dict>
	                <key>source</key>
	                <string>%found_filename%</string>
	                <key>target</key>
	                <string>%pkgroot%/Applications/Fuze.app</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>PlistReader</string>
	            <key>Arguments</key>
	            <dict>
	                <key>info_path</key>
	                <string>%pkgroot%/Applications/Fuze.app</string>
	                <key>plist_keys</key>
	                <dict>
	                    <key>CFBundleShortVersionString</key>
	                    <string>version</string>
	                    <key>CFBundleIdentifier</key>
	                    <string>PKG_ID</string>
	                </dict>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>CodeSignatureVerifier</string>
	            <key>Arguments</key>
	            <dict>
	                <key>input_path</key>
	                <string>%RECIPE_CACHE_DIR%/%NAME%/Fuze.app</string>
	                <key>requirement</key>
	                <string>anchor apple generic and identifier "com.fuzebox.fuze.FuzeLauncher" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z94XCC8A5K)</string>
	            </dict>
	        </dict>
	    </array>
	</dict>
	</plist>
