<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the latest version of HUE and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.HUE</string>
    <key>Input</key>
    <dict>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
        <key>NAME</key>
        <string>Fuze</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Fuze</string>
        <key>MINIMUM_OS_VERSION</key>
        <string>10.12.0</string>
        <key>pkginfo</key>
        <dict>
        	<key>blocking_applications</key>
            <array>
                <string>Fuze</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>Fuze</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.pkg.Fuze</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%MINIMUM_OS_VERSION%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
