<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of ScrollReverser</string>
  <key>Identifier</key>
  <string>com.github.nielshojen.download.ScrollReverser</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>ScrollReverser</string>
    <key>BASE_URL</key>
    <string>https://pilotmoon.com</string>
    <key>SEARCH_URL</key>
    <string>%BASE_URL%/scrollreverser</string>
    <key>SEARCH_PATTERN</key>
    <string>(\/downloads\/ScrollReverser-(?P&lt;version&gt;.*?).zip)</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%SEARCH_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%-%version%.zip</string>
        <key>url</key>
        <string>%BASE_URL%%match%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>