<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RØDE Central, unpacks it and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.RODECentral</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Audio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
    	<key>NAME</key>
    	<string>RODECentral</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>RØDE</string>
            <key>description</key>
            <string>Unlock advanced features for the Wireless GO II with RØDE Central! This easy-to-use companion app lets you set up your device preferences, access, optimise and export recordings, activate and deactivate functions, and update your firmware.</string>
            <key>display_name</key>
            <string>RODE Central</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.RODECentral</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-%version%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/flat</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/flat/RodeCentral.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
     	<dict>
    		<key>Processor</key>
    		<string>MunkiInstallsItemsCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>faux_root</key>
    			<string>%RECIPE_CACHE_DIR%/payload</string>
    			<key>derive_minimum_os_version</key>
    			<string>True</string>
    			<key>installs_item_paths</key>
    			<array>
	    			<string>/Applications/RODE Central.app</string>
				</array>
    		</dict>
    	</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.rode.rodecentral</string>
                            <key>CFBundleName</key>
                            <string>RODE Central</string>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>minosversion</key>
                            <string>%minimum_os_version%</string>
                            <key>path</key>
                            <string>/Applications/RODE Central.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                    </array>
					<key>minimum_os_version</key>
					<string>%minimum_os_version%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
