<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RØDE Central.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.RODECentral</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RODECentral</string>
        <key>DOWNLOAD_PATTERN</key>
        <string>(?P&lt;url&gt;https:\/\/edge.rode.com\/zip\/page\/[0-9]+\/modules\/[0-9]+\/RODE Central macOS v(?P&lt;version&gt;.*?).zip)</string>
        <key>DOWNLOAD_URL</key>
        <string>https://rode.com/en/software/rode-central#module_19</string>
    </dict>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/URLEncoder</string>
			<key>Arguments</key>
			<dict>
				<key>input_url</key>
				<string>%match%</string>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
        <dict>
            	<key>Processor</key>
            	<string>FileFinder</string>
            	<key>Arguments</key>
            	<dict>
                	<key>pattern</key>
                	<string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
            	</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>FileMover</string>
	        <key>Arguments</key>
	        <dict>
	            <key>source</key>
	            <string>%found_filename%</string>
	            <key>target</key>
	            <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-%version%.pkg</string>
	        </dict>
	    </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: FREEDMAN ELECTRONICS PTY LTD (Z9T72PWTJA)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
