<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TIDAL , creates a fileset and imports into filewave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.TIDAL</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TIDAL</string>
		<key>fw_app_bundle_id</key>
		<string>>com.github.nielshojen.pkg.TIDAL</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.TIDAL</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
