<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version PyCharm CE.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.pycharmce</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharm CE</string>
        <key>PLATFORM</key>
        <string>mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.nielshojen.SharedProcessors/JetbrainsURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_code</key>
                <string>PCC</string>
                <key>platform</key>
                <string>%PLATFORM%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
				<key>filename</key>
				<string>%NAME%-%PLATFORM%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/PyCharm CE.app</string>
                <key>requirement</key>
                <string>identifier "com.jetbrains.pycharm.ce" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
