<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Java 8, Creates a Fileset and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.OracleJava8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Java</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.OracleJava8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/Java 8 Update*.app/Contents/Resources/JavaAppletPlugin.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0775</string>
					<key>Library/Internet Plug-Ins</key>
					<string>0775</string>
					<key>Library/Application Support</key>
					<string>0775</string>
					<key>Library/Application Support/Oracle</key>
					<string>0775</string>
					<key>Library/Application Support/Oracle/Java</key>
					<string>0775</string>
					<key>Library/Internet Plug-Ins/JavaAppletPlugin.plugin</key>
					<string>0775</string>
					<key>Library/PreferencePanes</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/JavaAppletPlugin.plugin</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/javaappletplugin.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application\ Support/Oracle/Java/Info.plist</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Home/lib/deploy/JavaControlPanel.prefPane</string>
			</dict>
			<key>Processor</key>
			<string>Symlinker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application\ Support/Oracle/Java/javaws</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Home/bin/_javaws</string>
			</dict>
			<key>Processor</key>
			<string>Symlinker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/PreferencePanes/JavaControlPanel.prefPane</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Enabled.plist</string>
			</dict>
			<key>Processor</key>
			<string>Symlinker</string>
		</dict>
	</array>
</dict>
</plist>
