<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Checks for the update of a MAS app.  If the version on disk is up to date, then package it up and import into Munki.  If out of date, abort. If pyasn1 is installed, updates will be checked beforehand from the App Store.  Install pyasn1 here: sudo pip install git+https://github.com/geertj/python-asn1.git#egg=pyasn1</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.FinalCutProX</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/apple</string>
        <key>NAME</key>
        <string>FinalCutPro</string>
        <key>DISPLAY_NAME</key>
        <string>Final Cut Pro</string>
        <key>PATH</key>
        <string>/Applications/%NAME%.app</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.pkg.appstorespecial</string>
	<key>Process</key>
    <array>
	<dict>
		<key>Processor</key>
		<string>Versioner</string>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>/Applications/%NAME%.app/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>LSMinimumSystemVersion</string>
		</dict>
	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    		<key>Arguments</key>
    		<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>blocking_applications</key>
					<array>
						<string>%NAME%</string>
					</array>
					<key>minimum_os_version</key>
					<string>%version%</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh

# create _MASReceipt folder (if it does not exist)
mkdir -p &quot;%PATH%/Contents/_MASReceipt&quot;

# create/overwrite the receipt file
cat /dev/null &gt; &quot;%PATH%/Contents/_MASReceipt/receipt&quot;
					</string>
				</dict>	
			</dict>
		</dict>
     	<dict>
    		<key>Processor</key>
    		<string>MunkiInstallsItemsCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>faux_root</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    			<key>installs_item_paths</key>
    			<array>
	    			<string>%PATH%</string>
				</array>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    	</dict>
	   	<dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        			<string>%RECIPE_CACHE_DIR%/payload</string>
        		</array>
        	</dict>
        </dict>
    </array>
</dict>
</plist>
