<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into FileWave directly. If out of date, abort.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.iMovie</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iMovie</string>
        <key>PATH</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.check.appstore</string>
	<key>Process</key>
    <array>
 		<dict>
	    	<key>Processor</key>
	    	<string>StopProcessingIf</string>
	    	<key>Arguments</key>
	    	<dict>
	    		<key>predicate</key>
	    		<string>update_available == YES</string>
	    	</dict>
    	</dict>
   		<dict>
    		<key>Processor</key>
    		<string>Copier</string>
    		<key>Arguments</key>
    		<dict>
     			<key>source_path</key>
    			<string>%PATH%</string>
	   			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/payload/%PATH%</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    </array>
</dict>
</plist>
