<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into Munki directly. If out of date, abort.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.Keynote</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Keynote</string>
		<key>DISPLAY_NAME</key>
		<string>Keynote</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/apple</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
        <key>PATH</key>
        <string>/Applications/%DISPLAY_NAME%.app</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string></string>
			<key>developer</key>
			<string>Apple</string>
			<key>display_name</key>
			<string>Keynote</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%PATH%/Contents/Info.plist</string>
            </dict>
        </dict>
   		<dict>
    		<key>Processor</key>
    		<string>Copier</string>
    		<key>Arguments</key>
    		<dict>
     			<key>source_path</key>
    			<string>%PATH%</string>
	   			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/MASReceiptWipe</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%/Contents/_MASReceipt/receipt</string>
			</dict>
		</dict>
    	<dict>
    		<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
    	</dict>
    	<dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        		</array>
        	</dict>
        </dict>
	</array>
</dict>
</plist>
