<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into Munki directly. If out of date, abort.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.Numbers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Numbers</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/apple</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string></string>
			<key>developer</key>
			<string>Apple</string>
			<key>display_name</key>
			<string>Numbers</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.pkg.appstore</string>
	<key>Process</key>
    <array>
	<dict>
		<key>Processor</key>
		<string>Versioner</string>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%PATH%/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>LSMinimumSystemVersion</string>
		</dict>
	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    		<key>Arguments</key>
    		<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>blocking_applications</key>
					<array>
						<string>%NAME%</string>
					</array>
					<key>minimum_os_version</key>
					<string>%version%</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh

# create _MASReceipt folder (if it does not exist)
mkdir -p &quot;%PATH%/Contents/_MASReceipt&quot;

# create/overwrite the receipt file
cat /dev/null &gt; &quot;%PATH%/Contents/_MASReceipt/receipt&quot;
					</string>
				</dict>	
			</dict>
		</dict>
     	<dict>
    		<key>Processor</key>
    		<string>MunkiInstallsItemsCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>faux_root</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    			<key>installs_item_paths</key>
    			<array>
	    			<string>%PATH%</string>
				</array>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    	</dict>
	   	<dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/payload</string>
        		</array>
        	</dict>
        </dict>
    </array>
</dict>
</plist>
