<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Checks a MAS app for update. Requires override of NAME and PATH. If pyasn1 is NOT installed, this will not perform any actual check and return true for update_available.  Install here: sudo pip install git+https://github.com/geertj/python-asn1.git#egg=pyasn1</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.check.appstore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xcode</string>
        <key>PATH</key>
        <string>/Applications/%NAME%.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_item</key>
                <string>%PATH%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.nielshojen.SharedProcessors/AppStoreUpdateChecker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
