<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into Munki directly. If out of date, abort.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.Xcode</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Xcode</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/apple</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string></string>
			<key>developer</key>
			<string>Apple</string>
			<key>display_name</key>
			<string>Xcode</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<fasle/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.check.appstore</string>
	<key>Process</key>
	<array>

	</array>
</dict>
</plist>
