<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>MUNKI_CATEGORY</key>
	<string>Office</string>
    <key>Description</key>
    <string>This recipe downloads and imports the latest Nik Collection into Munki</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.NikCollection</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NikCollection</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/DxO</string>
        <key>MINIMUM_OS_VERSION</key>
        <string>10.12.0</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Nik Collection by DxO is a series of 7 renowned creative MacOS and Windows plugins for Adobe Photoshop, Adobe Photoshop Elements and Adobe Lightroom, providing filters, rendering and photography retouching tools to create stunning images. It leverages the U-PointTM technology for localized adjustments, and adds a full set of editing functionalities for amazing pictures: your pictures.</string>
            <key>display_name</key>
            <string>Nik Collection</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.pkg.NikCollection</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%MINIMUM_OS_VERSION%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
