<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of OBSBOT Center. ARCH can be set to Apple for arm64 and Intel for x86_64</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.OBSBOTCenter</string>
    <key>Input</key>
    <dict>
		<key>ARCH</key>
		<string>Apple</string>
        <key>SEARCH_PATTERN</key>
		<string>Obsbot_Center_OA_E_MacOS_Apple_[^\"]*\.dmg</string>
		<key>SEARCH_URL</key>
		<string>https://www.obsbot.com/download/obsbot-tail-2</string>
        <key>NAME</key>
        <string>OBSBOTCenter</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
                <key>result_output_var_name</key>
                <string>APP_URL</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.nielshojen.SharedProcessors/OBSBOTURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>file</key>
                <string>%APP_URL%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.obsbot.OBSBOT_Center" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7GJANK3822"</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>