<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Barcode Studio form TEC-IT.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.download.BarcodeStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BarCode Studio</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.tec-it.com/download/Unix/Mac-OS/BarCode-Studio-MacOSX.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/BarCode-Studio-MacOSX.zip</string>
				<key>purge_destination</key>
				<string>true</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>archive_format</key>
				<string>zip</string>
			</dict>
		</dict>
		<dict>
            		<key>Processor</key>
            		<string>FileFinder</string>
            		<key>Arguments</key>
            		<dict>
                		<key>pattern</key>
                		<string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
			</dict>
            	</dict>
		<dict>
            		<key>Processor</key>
            		<string>FlatPkgUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>purge_destination</key>
                		<string>TRUE</string>
                		<key>destination_path</key>
                		<string>%RECIPE_CACHE_DIR%/app</string>
                		<key>flat_pkg_path</key>
                		<string>%found_filename%</string>
			</dict>
            	</dict>
	</array>
</dict>
</plist>
