<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Barcode Studio from TEC-IT and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.BarcodeStudio</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.BarcodeStudio</string>
	<key>Input</key>
	<dict>
	<key>NAME</key>
	<string>BarCode Studio</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.nielshojen.filewave.BarcodeStudio</string>
	<key>fw_destination_root</key>
	<string>/</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/app/Applications</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
