<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AxureRP, creates a fileset and imports in FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.AxureRP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Axure RP 8</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.thenikola.download.AxureRP</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/*.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
