<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Universal Type Client 6 and imports a fileset.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.UniversalTypeClient6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EIZO Color Navigator</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.UniversalTypeClient6</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.download.UniversalTypeClient6</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unzip/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
        	<dict>
            		<key>Processor</key>
            		<string>FlatPkgUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>flat_pkg_path</key>
                		<string>%found_filename%</string>
                		<key>destination_path</key>
                		<string>%RECIPE_CACHE_DIR%/unpack</string>
            		</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
           		<key>Processor</key>
            		<string>PkgPayloadUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>pkg_payload_path</key>
                		<string>%RECIPE_CACHE_DIR%/unpack/universalTypeClient.pkg/Payload</string>
                		<key>destination_path</key>
				<string>%pkgroot%/Applications</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
