<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Re-packages, and imports Extensis Universal Type Client 7 into Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.munki.UniversalTypeClient7</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Font Management</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/extensis</string>
		<key>NAME</key>
		<string>UniversalTypeClient</string>
		<key>INSTALLCHECK_TEMPLATE</key>
		<string>UniversalTypeClient7.installcheck.template</string>
		<key>PKG_INSTALLCHECK</key>
		<string>UniversalTypeClient7.installcheck</string>
		<key>PKG_POSTINSTALL</key>
		<string>UniversalTypeClient7.postinstall</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Photoshop</string>
				<string>Adobe Illustrator</string>
				<string>Adobe InDesign</string>
				<string>Universal Type Client</string>
				<string>QuarkXPress</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Managing your fonts with Universal Type Server fuels your team’s creativity and productivity.

Store all of your fonts in a centralized, server-based font manager to ensure consistent, worry-free font usage across all of your projects.</string>
			<key>developer</key>
			<string>Extensis</string>
			<key>display_name</key>
			<string>Universal Type Client</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>i386</string>
				<string>x86_64</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.pkg.UniversalTypeClient7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Universal Type Client.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://s3.amazonaws.com/cs.us.extensis.com/fm_uninstall/utc/utc-removal-tool.zip</string>
				<key>filename</key>
				<string>utc-removal-tool.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/utc-removal-tool.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/utc-removal-tool</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%INSTALLCHECK_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>FindResource</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>template_path</key>
				<string>%found_resource%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%PKG_INSTALLCHECK%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.scriptingosx.SharedProcessors/FileTemplate</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%RECIPE_CACHE_DIR%/utc-removal-tool/UTC-Removal-Tool.command</string>
				</array>
				<key>_additional_makepkginfo_options</key>
				<array>
					<string>--installcheck_script=%RECIPE_CACHE_DIR%/%PKG_INSTALLCHECK%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unzip</string>
					<string>%RECIPE_CACHE_DIR%/utc-removal-tool</string>
					<string>%RECIPE_CACHE_DIR%/UniversalTypeClient7.installcheck</string>
					<string>%RECIPE_CACHE_DIR%/downloads/utc-removal-tool.zip</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
