<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Sonos.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.Sonos</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sonos Controller</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>http://www.sonos.com/support</string>
              <key>re_pattern</key>
              <string>(?P&lt;url&gt;http.*?controller_software_mac)</string>
              <key>request_headers</key>
              <dict>
                      <key>user-agent</key>
                      <string>%USER_AGENT%</string>
              </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>SonosDesktopController.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>requirement</key>
                <string>identifier "com.sonos.macController" and anchor apple generic</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
