<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DaVinci Resolve Studio. Major version to search for is set in the APP_VERSION variable.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.davinciresolvestudio</string>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.download.davinciresolve14</string>
    <key>Input</key>
    <dict>
		<key>APP_VERSION</key>
		<string>16</string>
		<key>PRODUCT_NAME_PATTERN</key>
		<string>^DaVinci Resolve Studio (?P&lt;version&gt;%APP_VERSION%(\.\d+)*)( Update)*$</string>
        <key>NAME</key>
        <string>DaVinciResolveStudio</string>
        <key>REG_FIRSTNAME</key>
        <string></string>
        <key>REG_LASTNAME</key>
        <string></string>
        <key>REG_EMAIL</key>
        <string></string>
        <key>REG_PHONE</key>
        <string></string>
        <key>REG_CITY</key>
        <string></string>
        <key>REG_STATE</key>
        <string></string>
        <key>REG_COUNTRY</key>
        <string></string>
    </dict>
</dict>
</plist>
