<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DaVinci Resolve 12.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.davinciresolve12</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^DaVinci Resolve (?P&lt;version&gt;12(\.\d+)*)( Update)*$</string>
        <key>NAME</key>
        <string>DaVinciResolve12</string>
        <key>REG_FIRSTNAME</key>
        <string>Firstname</string>
        <key>REG_LASTNAME</key>
        <string>Lastname</string>
        <key>REG_EMAIL</key>
        <string>firstname.lastname@company.com</string>
        <key>REG_PHONE</key>
        <string>99420000</string>
        <key>REG_CITY</key>
        <string>Brande</string>
        <key>REG_STATE</key>
        <string>Denmark</string>
        <key>REG_COUNTRY</key>
        <string>dk</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>BlackMagicURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_name_pattern</key>
                <string>%PRODUCT_NAME_PATTERN%</string>
                <key>product_name</key>
                <string>DaVinci Resolve</string>
                <key>registration_info</key>
                <dict>
                    <key>firstname</key>
                    <string>%REG_FIRSTNAME%</string>
                    <key>lastname</key>
                    <string>%REG_LASTNAME%</string>
                    <key>email</key>
                    <string>%REG_EMAIL%</string>
                    <key>phone</key>
                    <string>%REG_PHONE%</string>
                    <key>city</key>
                    <string>%REG_CITY%</string>
                    <key>state</key>
                    <string>%REG_STATE%</string>
                    <key>country</key>
                    <string>%REG_COUNTRY%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
