<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Desktop Video 10</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.DesktopVideo10</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^Desktop Video (?P&lt;version&gt;10(\.\d+)*)( Update)*$</string>
        <key>NAME</key>
        <string>Desktop Video</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>BlackMagicURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_name_pattern</key>
                <string>%PRODUCT_NAME_PATTERN%</string>
                <key>product_name</key>
                <string>Desktop Video</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
