<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Blackmagic Desktop Video 10 and imports it into filewave</string>
        <key>Identifier</key>
        <string>com.github.nielshojen.filewave.DiskSpeedTest3</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Disk Speed Test</string>
            <key>fw_app_bundle_id</key>
            <string>com.github.nielshojen.filewave.DiskSpeedTest3</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.nielshojen.download.DesktopVideo10</string>
        <key>Process</key>
        <array>
            <dict>
            <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unzip</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%found_filename%/*.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/DiskSpeedTest.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/Applications/Blackmagic Disk Speed Test.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleVersion</string>
                </dict>
                <key>Processor</key>
		<string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
			<key>fw_app_bundle_id</key>
			<string>%fw_app_bundle_id%</string>
			<key>fw_app_version</key>
			<string>%version%</string>
			<key>fw_destination_root</key>
			<string>/</string>
			<key>fw_fileset_name</key>
			<string>%NAME% %version%</string>
			<key>fw_import_source</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
                </dict>
                <key>Processor</key>
                <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
            </dict>
        </array>
    </dict>
</plist>
