<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current mpkg of Colorbrite ccProfiler</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.ccProfiler</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_PATTERN</key>
		<string>(?P&lt;url&gt;https://github.com/LUMESCA/calibrite-profiler-releases/releases/download/v(?P&lt;version&gt;.*?)/calibrite-PROFILER-.*.dmg)</string>
		<key>DOWNLOAD_URL</key>
		<string>https://calibrite.com/us/software-downloads/?noredirect=en-US</string>
        <key>NAME</key>
        <string>ccProfiler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/calibrite PROFILER.app</string>
				<key>requirement</key>
				<string>identifier "com.calibrite.profiler" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5C392763F5"</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>