<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import Calibrite ccProfiler into your munki repository</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.ccProfiler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ccProfiler</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/XRite</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>ccProfilerTray</string>
                <string>ccProfiler</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ccProfiler software powered by X-Rite, for calibrating and profiling all modern laptop, desktop monitor and projector technologies</string>
            <key>developer</key>
            <string>Calibrite</string>
            <key>display_name</key>
            <string>ccProfiler</string>
            <key>minimum_os_version</key>
            <string>10.15</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.download.ccProfiler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>