<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Slido Switcher</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.SlidoSwitcher</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Slido Switcher</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.sli.do/download-switcher-mac</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
