<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC '-//Apple//DTD PLIST 1.0//EN' 'http://www.apple.com/DTDs/PropertyList-1.0.dtd'>
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Wacom Inkspace and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.nielshojen.munki.WacomInkspace</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>WacomInkspace</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Wacom</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Wacom Inkspace App</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Wacom Inkspace</string>
			<key>MUNKI_NAME</key>
			<string>%NAME%</string>
			<key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Wacom Inkspace App.app</string>
                </array>
				<key>name</key>
				<string>%MUNKI_NAME%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>uninstall_method</key>
				<string>removepackages</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.nielshojen.pkg.WacomInkspace</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<string>%RECIPE_CACHE_DIR%/%pkg_path%</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
