<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Wacom Intuos driver fileset and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.WacomIntuosDriverInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Wacom Intuos Driver</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.WacomIntuosDriverInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.download.WacomIntuos</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/content.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/Tablet/WacomTabletDriver.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/installer</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
	<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Install Wacom Tablet.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/installer/Install_Wacom_Tablet_%version%.pkg</string>
                <key>overwrite</key>
                <string>TRUE</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>RECIPE_CACHE_DIR%/installer/*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
	</array>
</dict>
</plist>
