<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Wacom Intuos driver fileset and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.WacomIntuosDriverInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Wacom Intuos Driver</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.WacomIntuosDriverInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.download.WacomIntuos</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Install Wacom Tablet.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Install_Wacom_Tablet_%version%.pkg</string>
                <key>overwrite</key>
                <string>TRUE</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
