<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of USB Overdrive and imports it into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.filewave.USBOverdrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>USB Overdrive</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.pkg.filewave.USBOverdrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.download.USBOverdrive</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/USB Overdrive.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack2</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack2/Applications/Utilities/Uninstall %DISPLAY_NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Install %NAME%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME% - %version%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
		<dict>		
 			<key>Arguments</key>		
 			<dict>		
 				<key>path_list</key>		
 				<array>		
					<string>%RECIPE_CACHE_DIR%/unpack</string>		
					<string>%RECIPE_CACHE_DIR%/unpack2</string>		
 				</array>		
 			</dict>		
 			<key>Processor</key>		
 			<string>PathDeleter</string>		
 		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%RECIPE_CACHE_DIR%/%NAME% - %version%.pkg</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
