<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Wacom Intuos driver fileset and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.googlevoiceandvideo</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Google Voice And Video</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.googlevoiceandvideo</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.GoogleVoiceAndVideo</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
	</array>
</dict>
</plist>
