<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Santa, creates a fileset and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.googlechrome</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Santa</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.pkg.googlechrome</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.googlechrome</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
