<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Adobe Output Module for 2015 and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.AdobeOutputModule2015</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Output Module 2015</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.AdobeOutputModule2015</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.pkg.AdobeOutputModule2015</string>
	<key>Process</key>
	<array>

	</array>
</dict>
</plist>
