<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adobe Reader TC and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Acrobat Reader DC</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.AdobeReaderDC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeReaderDC</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkgdirs</key>
			<dict>
				<key>Applications</key>
				<string>0775</string>
				<key>Library</key>
				<string>0775</string>
				<key>Library/Application Support</key>
				<string>0775</string>
				<key>Library/Internet Plug-Ins</key>
				<string>0775</string>
			</dict>
			<key>pkgroot</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
		</dict>
		<key>Processor</key>
		<string>PkgRootCreator</string>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/application.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
    		<dict>
    			<key>Processor</key>
    			<string>Decompress</string>
    			<key>Arguments</key>
    			<dict>
    				<key>decompressor</key>
    				<string>%RECIPE_CACHE_DIR%/payload/Applications/Adobe Acrobat Reader DC.app/Contents</string>
    			</dict>
		</dict>
        	<dict>
        		<key>Processor</key>
        		<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
       		    	<key>path_list</key>
        	    	<array>
        	        	<string>%RECIPE_CACHE_DIR%/payload/Applications/Adobe Acrobat Reader DC.app/Contents/decompress</string>
        	    	</array>
        		</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/browser.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/support.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/Adobe Acrobat Reader DC.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>/</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
