<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Flash Player installer, creates fileset andd imports into filewave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.FlashPlayer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adobe Flash Player</string>
	<key>fw_app_bundle_id</key>
	<string>com.github.nielshojen.filewave.FlashPlayer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.FlashPlayer</string>
    <key>Process</key>
    <array>
    	<dict>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%pathname%/Install Adobe Flash Player.app/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>CFBundleVersion</string>
		</dict>
		<key>Processor</key>
		<string>Versioner</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack</string>
			<key>flat_pkg_path</key>
			<string>%pathname%/Install Adobe Flash Player.app/Contents/Resources/*.pkg</string>
		</dict>
		<key>Processor</key>
		<string>FlatPkgUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
			<key>pkg_payload_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Payload</string>
		</dict>
		<key>Processor</key>
		<string>PkgPayloadUnpacker</string>
	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>LZMADecompress</string>
    		<key>Arguments</key>
    		<dict>
    			<key>lzma_file</key>
    			<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/Flash Player.plugin.lzma</string>
    			<key>decompressor</key>
    			<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Scripts/finalize</string>
    		</dict>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>fw_app_bundle_id</key>
			<string>%fw_app_bundle_id%</string>
			<key>fw_app_version</key>
			<string>%version%</string>
			<key>fw_destination_root</key>
			<string>/</string>
			<key>fw_fileset_name</key>
			<string>%NAME% %version%</string>
			<key>fw_import_source</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
		</dict>
		<key>Processor</key>
		<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
	</dict>
    </array>
</dict>
</plist>
