
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.AdobeOutputModuleCC2017</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/adobe</string>
      <key>NAME</key>
      <string>Adobe Output Module CC 2017</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Productivity</string>
        <key>description</key>
        <string>Adobe Output Module for Bridge CC 2017</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_name</key>
        <string>Adobe Output Module CC 2017</string>
        <key>name</key>
        <string>Adobe Output Module CC 2017</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.pkg.AdobeOutputModuleCC2017</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
