<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest TeamViewer disk image and import to Filewave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.TeamViewerHostInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewer Host</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.TeamViewerHostInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.TeamViewerHost</string>
	<key>Process</key>
	<array>


	</array>
</dict>
</plist>
