<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest TeamViewer disk image and import to Filewave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.TeamViewerHostInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewer Host</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.TeamViewerHostInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.TeamViewerHost</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/unpkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/unpkg/Install_TeamviewerHost.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/Install TeamviewerHost.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
