<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Get newest Custom TeamViewer Quick Support app, create a package and import into FileWave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.filewave.TeamViewerQSCustom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewer Quick Support</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.pkg.filewave.TeamViewerQSCustom</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nielshojen.pkg.TeamViewerQSCustom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
        <dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%pkg_path%</string>
				</array>
        		</dict>
        </dict>
	</array>
</dict>
</plist>
