<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of TablePlus.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.TablePlus</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_PATTERN</key>
		<string>https://download.tableplus.com/macos/\d{3}.\d{1}/TablePlus.dmg</string>
        <key>NAME</key>
        <string>TablePlus</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>https://tableplus.com/release/osx/tableplus_latest</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
