<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Intune Company Portal installer, downloads the pkg.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.IntuneCompanyPortal</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>IntuneCompanyPortal</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.nielshojen.SharedProcessors/MSOffice2016URLandUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product</key>
                <string>%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
