<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Intune Company Portal updater and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.IntuneCompanyPortal</string>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>IntuneCompanyPortal</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/microsoft</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Intune Company Portal</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft AutoUpdate</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>display_name</key>
            <string>Microsoft Intune Company Portal</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nielshojen.pkg.IntuneCompanyPortal</string>
    <key>Process</key>
    <array>
     	<dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Company Portal.app</string>
                </array>
    			<key>derive_minimum_os_version</key>
    			<string>True</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>