<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports MS OneDrive Installer into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.MSOneDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OneDrive</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.MSOneDrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.download.MSOneDrive</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>TRUE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <string>TRUE</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/app</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/OneDrive.pkg/Payload</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/OneDrive.pkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
