<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into FileWave directly. If out of date, abort.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.pkg.filewave.MSRemoteDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Remote Desktop</string>
		<key>PATH</key>
		<string>/Applications/%NAME%.app</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.pkg.filewave.MSRemoteDesktop</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.check.appstore</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>update_available == YES</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%PATH%</string>
				<key>destination_path</key>
				<string>%pkgroot%%PATH%</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/MASReceiptWipe</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%destination_path%/Contents/_MASReceipt/receipt</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%version%.pkg</string>
				<key>app_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
        	<dict>
        		<key>Processor</key>
        		<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
        		</dict>
		</dict>
	</array>
</dict>
</plist>
