<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks for the update of a MAS app.  If the version on disk is up to date, then copy to  cache, edit MAS recipt and import into FileWave directly. If out of date, abort.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.fileset.filewave.MSRMSSharing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RMS Sharing</string>
		<key>PATH</key>
		<string>/Applications/%NAME%.app</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.fileset.filewave.MSRMSSharing</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%PATH%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload%PATH%</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/MASReceiptWipe</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%destination_path%/Contents/_MASReceipt/receipt</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%destination_path%</string>
				<key>fw_destination_root</key>
				<string>%PATH%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
        <dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
		<key>Arguments</key>
		<dict>
       		    <key>path_list</key>
        	    <array>
        	        <string>%RECIPE_CACHE_DIR%/payload</string>
        	    </array>
        	</dict>
	</dict>
	</array>
</dict>
</plist>
