<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
	<string>Downloads latest version of Skype for Business installer and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.MSSkypeforBusiness</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.SkypeForBusiness</string>
	<key>Input</key>
	<dict>
    	<key>NAME</key>
    	<string>Skype for Business</string>
    	<key>fw_app_bundle_id</key>
    	<string>com.github.nielshojen.filewave.pkg.MSSkypeforBusiness</string>
	</dict>
	<key>Process</key>
	<array>

	</array>
</dict>
</plist>
