<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest MS Teams, creates an installer and imports to Filewave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.pkg.MSTeams</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Teams</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.pkg.MSTeams</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.download.MSTeams</string>
	<key>Process</key>
	<array>
    		<dict>
    			<key>Processor</key>
    			<string>com.github.nielshojen.SharedProcessors/VersionExtractor</string>
    			<key>Arguments</key>
    			<dict>
				<key>input_file</key>
				<string>%url%</string>
    				<key>split_on_in</key>
    				<string>production-osx/</string>
    				<key>split_on_out</key>
    				<string>/Teams_osx.pkg</string>
    			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
