<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Silverlight, creates a fileset and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.Silverlight</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Silverlight</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.Silverlight</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Silverlight</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/flatpkg</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/Silverlight.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        	<dict>
            		<key>Processor</key>
            		<string>PkgPayloadUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>purge_destination</key>
                		<string>TRUE</string>
                		<key>destination_path</key>
                		<string>%RECIPE_CACHE_DIR%/payload</string>
                		<key>pkg_payload_path</key>
                		<string>%RECIPE_CACHE_DIR%/flatpkg/silverlight_plugin.pkg/Payload</string>
            		</dict>
        	</dict>
        	<dict>
            		<key>Processor</key>
            		<string>Versioner</string>
            		<key>Arguments</key>
            		<dict>
                		<key>input_plist_path</key>
                		<string>%RECIPE_CACHE_DIR%/payload/Library/Internet Plug-Ins/Silverlight.plugin/Contents/Info.plist</string>
            		</dict>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>/</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
