<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of HUE.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.HUE</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HUE</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.creativeforce.io/hue</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Safari 8.0.2</string>
                </dict>
                <key>filename</key>
                <string>HUE.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
