<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of HUE.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.download.HUE</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_PATTERN</key>
		<string>(HUE-+[0-9].+[0-9].+[0-9]-mac)</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.creativeforce.io/released-files/prod/hue/mac/latest-mac.yml</string>
        <key>NAME</key>
        <string>HUE</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/VersionExtractor</string>
			<key>Arguments</key>
			<dict>
				<key>input_file</key>
				<string>%match%</string>
				<key>split_on_in</key>
				<string>-</string>
				<key>split_on_out</key>
				<string>-</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://lh-applications-release.s3.amazonaws.com/prod/hue/mac/%match%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Pixelz Services ApS (JR5S5H3FYD)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
