<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads 1Password and imports into filewave.</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.filewave.1Password</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>1Password</string>
	<key>fw_app_bundle_id</key>
	<string>com.github.nielshojen.filewave.1Password</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>io.github.hjuutilainen.download.1Password</string>
    <key>Process</key>
    <array>
        <dict>
            	<key>Processor</key>
            	<string>FileFinder</string>
            	<key>Arguments</key>
            	<dict>
                	<key>pattern</key>
                	<string>%RECIPE_CACHE_DIR%/Applications/*.app</string>
            	</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/Applications/*.app</string>
				<key>fw_destination_root</key>
				<string>/Applications</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    	</array>
</dict>
</plist>
