<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest CUDA driver, creates fileset and imports into Filewave</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.NvidiaCUDADriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NVidia CUDA Driver</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.NvidiaCUDADriver</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.download.CUDADriver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkgdirs</key>
			<dict>
				<key>Library</key>
				<string>0775</string>
				<key>Library/Frameworks</key>
				<string>0775</string>
				<key>Library/LaunchAgents</key>
				<string>0775</string>
				<key>Library/LaunchDaemons</key>
				<string>0775</string>
				<key>Library/PreferencePanes</key>
				<string>0775</string>
				<key>System</key>
				<string>0775</string>
				<key>System/Library</key>
				<string>0775</string>
				<key>System/Library/Extensions</key>
				<string>0775</string>
				<key>usr/</key>
				<string>0775</string>
				<key>usr/local/</key>
				<string>0775</string>
				<key>usr/local/cuda</key>
				<string>0775</string>
				<key>usr/local/cuda/lib</key>
				<string>0775</string>
			</dict>
			<key>pkgroot</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
		</dict>
		<key>Processor</key>
		<string>PkgRootCreator</string>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                		<key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Frameworks</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDAFramework.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		                <key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/System/Library/Extensions</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDAKext.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		                <key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/LaunchAgents</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDALaunchAgent.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		                <key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/LaunchDaemons</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDALaunchDaemon.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		                <key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/PreferencePanes</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDAPrefPane.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		                <key>purge_destination</key>
                		<false/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/usr/local/cuda/lib</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDAUnixLib.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>/</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
