<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the latest Nvidia CUDA Driver into Munki</string>
    <key>Identifier</key>
    <string>com.github.nielshojen.munki.NvidiaCUDADriver</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_OS_VERSION</key>
        <string>10.13</string>
        <key>MUNKI_CATEGORY</key>
        <string>Drivers</string>
        <key>NAME</key>
        <string>NvidiaCUDADriver</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>drivers/nvidia</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>Nvidia CUDA Driver</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jessepeterson.download.CUDADriver</string>
    <key>Process</key>
    <array>
	    <dict>
		    <key>Arguments</key>
		    <dict>
			    <key>destination_path</key>
			    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			    <key>source_path</key>
			    <string>%pathname%/*.pkg</string>
		    </dict>
		    <key>Processor</key>
		    <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
