<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Camtasia and imports a fileset.</string>
	<key>Identifier</key>
	<string>com.github.nielshojen.filewave.ColorNavigator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EIZO Color Navigator</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.nielshojen.filewave.ColorNavigator</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ColorNavigator</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
        	<dict>
            		<key>Processor</key>
            		<string>FlatPkgUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>flat_pkg_path</key>
                		<string>%pathname%/*.pkg</string>
                		<key>destination_path</key>
                		<string>%RECIPE_CACHE_DIR%/unpack</string>
            		</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
           		<key>Processor</key>
            		<string>PkgPayloadUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                		<key>pkg_payload_path</key>
                		<string>%found_filename%/Payload</string>
                		<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/*.app</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
            		<key>Processor</key>
            		<string>Versioner</string>
            		<key>Arguments</key>
            		<dict>
                		<key>input_plist_path</key>
                		<string>%found_filename%/Contents/Info.plist</string>
			</dict>
            	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/payload/usr/local/lib/libftd2xx.*.dylib</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/usr/local/lib/libftp2xx.dylib</string>
			</dict>
			<key>Processor</key>
			<string>Symlinker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/EIZO/ColorNavigator 6/temp/basICColorDISCUS_10.9+.kext.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/System/Library/Extensions</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.nielshojen.SharedProcessors/ModeChanger</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/payload/System/Library/Extensions/basICColorDISCUS_10.9+.kext</string>
				<key>mode</key>
				<string>+x</string>
			</dict>
		</dict>
		<dict>
        		<key>Processor</key>
        		<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
       		    		<key>path_list</key>
        	    		<array>
		    			<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/EIZO/ColorNavigator 6/temp</string>
        	   		</array>
        		</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/EIZO/ColorNavigator 6/data_def</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/EIZO/ColorNavigator 6/data</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%bundleid%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>fw_destination_root</key>
				<string>/</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
